netify-soap/src/test/resources/soap/requests/role/GetRoleAllRequestNoFilterTest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:gen="http://mouthaan.org/namespace/netify/general">
    <soapenv:Header/>
    <soapenv:Body>
        <gen:GetRoleAllRequest/>
    </soapenv:Body>
</soapenv:Envelope>